; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain thoughtful-typed)
	(:requirements :typing)
	(:types card colnum num suittype)
	(:predicates (on ?dummy - card ?c1 - card ?c2 - card)
		(ace ?dummy - card ?c - card)
		(king ?dummy - card ?c - card)
		(clear ?dummy - card ?c - card)
		(colspace ?dummy - colnum ?n - colnum)
  		(bottomtalon ?dummy - card ?c - card)
		(toptalon ?dummy - card ?c - card)
		(ontalon ?dummy - card ?c1 - card ?c2 - card)
		(talonplayable ?dummy - card ?c - card)
		(instack ?dummy - card ?c - card)
		(home ?dummy - card ?c - card)
		(faceup ?dummy - card ?c - card)
		(bottomcol ?dummy - card ?c - card)
		(suit ?dummy - card ?c - card ?s - suittype)
		(value ?dummy - card ?c - card ?v - num)
		(successor ?dummy - num ?n1 - num ?n0 - num)
		(canstack ?dummy - card ?c1 - card ?c2 - card)
		(colsuccessor ?dummy - colnum ?n1 - colnum ?n0 - colnum)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card between columns.  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from one column to another

	(:action move-col-to-col
		:parameters (?card ?oldcard ?newcard - card)
		:precondition (and 
			(faceup ?card ?card)
			(clear ?newcard ?newcard)
			(canstack ?card ?card ?newcard)
			(on ?card ?card ?oldcard))
		:effect(and
			(on ?card ?card ?newcard)
			(clear ?oldcard ?oldcard)
			(faceup ?oldcard ?oldcard)
			(not (on ?card ?card ?oldcard))
			(not (clear ?newcard ?newcard))))

;; move card from one column to another - create an empty column

	(:action move-col-to-col-b
		:parameters (?card ?newcard - card ?cols ?ncols - colnum)
		:precondition (and 
				(faceup ?card ?card)
				(bottomcol ?card ?card)
				(clear ?newcard ?newcard)
				(canstack ?card ?card ?newcard)
				(colspace ?cols ?cols)
				(colsuccessor ?ncols ?ncols ?cols))
		:effect (and 
			(on ?card ?card ?newcard)
			(colspace ?ncols ?ncols)
			(not (bottomcol ?card ?card))
			(not (clear ?newcard ?newcard))
			(not (colspace ?cols ?cols))))

;; send a king to an empty column

	(:action move-col-to-col-c
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(faceup ?card ?card)
			(king ?card ?card)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols)
			(on ?card ?card ?oldcard))
		:effect (and
			(bottomcol ?card ?card)
			(clear ?oldcard ?oldcard)
			(faceup ?oldcard ?oldcard)
			(colspace ?ncols ?ncols)
			(not (on ?card ?card ?oldcard))
			(not (colspace ?cols ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from column to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action col-to-home
		:parameters (?card ?oldcard - card ?suit - suittype ?vcard - num
				?homecard - card ?vhomecard - num)
		:precondition (and
			(clear ?card ?card)
			(on ?card ?card ?oldcard)
			(home ?homecard ?homecard)
			(suit ?card ?card ?suit)
			(suit ?homecard ?homecard ?suit)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard))
		:effect (and
			(home ?card ?card)
			(clear ?oldcard ?oldcard)
			(faceup ?oldcard ?oldcard)
			(on ?card ?card ?homecard)
			(not (on ?card ?card ?oldcard))
			(not (home ?homecard ?homecard))
			(not (faceup ?card ?card))
			(not (clear ?card ?card))))

;; Move card from column to home - create an empty column

	(:action col-to-home-b
		:parameters (?card ?homecard - card ?suit - suittype ?vcard - num 
			?vhomecard - num ?cols ?ncols - colnum)
		:precondition (and
			(clear ?card ?card)
			(bottomcol ?card ?card)
			(home ?homecard ?homecard)
			(suit ?card ?card ?suit)
			(suit ?homecard ?homecard ?suit)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard)
			(colspace ?cols ?cols)
			(colsuccessor ?ncols ?ncols ?cols))
		:effect (and
			(home ?card ?card)
			(colspace ?ncols ?ncols)
			(not (home ?homecard ?homecard))
			(not (faceup ?card ?card))
			(not (clear ?card ?card))
			(not (bottomcol ?card ?card))
			(not (colspace ?cols ?cols))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to column 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action tal-to-col
		:parameters (?card ?oldcard ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard ?newcard)
			(ontalon ?card ?card ?oldcard)
			(ontalon ?cardabove ?cardabove ?card)
			(talonplayable ?card ?card)
			(canstack ?card ?card ?newcard))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(talonplayable ?oldcard ?oldcard)
			(on ?card ?card ?newcard)
			(ontalon ?cardabove ?cardabove ?oldcard)
			(not (clear ?newcard ?newcard))
			(not (talonplayable ?card ?card))
			(not (ontalon ?card ?card ?oldcard))
			(not (ontalon ?cardabove ?cardabove ?card))))

;; move card from talon to column - card is bottom card in talon

	(:action tal-to-col-b
		:parameters (?card ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard ?newcard)
			(ontalon ?cardabove ?cardabove ?card)
			(talonplayable ?card ?card)
			(bottomtalon ?card ?card)
			(canstack ?card ?card ?newcard))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(on ?card ?card ?newcard)
			(bottomtalon ?cardabove ?cardabove)
			(talonplayable ?cardabove ?cardabove)
			(not (bottomtalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (clear ?newcard ?newcard))
			(not (ontalon ?cardabove ?cardabove ?card))))

;; move card from talon to column - card is top card in talon

	(:action tal-to-col-c
		:parameters (?card ?newcard ?oldcard - card)
		:precondition (and
			(clear ?newcard ?newcard)
			(ontalon ?card ?card ?oldcard)
			(canstack ?card ?card ?newcard)
			(talonplayable ?card ?card)
			(toptalon ?card ?card))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(on ?card ?card ?newcard)
			(toptalon ?oldcard ?oldcard)
			(talonplayable ?oldcard ?oldcard)
			(not (clear ?newcard ?newcard))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (ontalon ?card ?card ?oldcard))))

;; move card from talon to column - card is the only card in talon

	(:action tal-to-col-d
		:parameters (?card ?newcard - card)
		:precondition (and
			(clear ?newcard ?newcard)
			(canstack ?card ?card ?newcard)
			(bottomtalon ?card ?card)
			(toptalon ?card ?card)
			(talonplayable ?card ?card))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(on ?card ?card ?newcard)
			(not (clear ?newcard ?newcard))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (bottomtalon ?card ?card))))

;; move king from talon to column

	(:action tal-to-col-e
		:parameters (?card ?oldcard ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card ?card)
			(ontalon ?card ?card ?oldcard)
			(ontalon ?cardabove ?cardabove ?card)
			(talonplayable ?card ?card)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(talonplayable ?oldcard ?oldcard)
			(ontalon ?cardabove ?cardabove ?oldcard)
			(bottomcol ?card ?card)
			(colspace ?ncols ?ncols)
			(not (colspace ?cols ?cols))
			(not (talonplayable ?card ?card))
			(not (ontalon ?card ?card ?oldcard))
			(not (ontalon ?cardabove ?cardabove ?card))))

;; move king from talon to column - king is bottom card in talon

	(:action tal-to-col-f
		:parameters (?card ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card ?card)
			(ontalon ?cardabove ?cardabove ?card)
			(talonplayable ?card ?card)
			(bottomtalon ?card ?card)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(bottomtalon ?cardabove ?cardabove)
			(talonplayable  ?cardabove ?cardabove)
			(bottomcol ?card ?card)
			(colspace ?ncols ?ncols)
			(not (colspace ?cols ?cols))
			(not (bottomtalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (ontalon ?cardabove ?cardabove ?card))))

;; move king from talon to column - card is top card in talon

	(:action tal-to-col-g
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card ?card)
			(ontalon ?card ?card ?oldcard)
			(talonplayable ?card ?card)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols)
			(toptalon ?card ?card))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(toptalon ?oldcard ?oldcard)
			(talonplayable ?oldcard ?oldcard)
			(bottomcol ?card ?card)
			(colspace ?ncols ?ncols)
			(not (colspace ?cols ?cols))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (ontalon ?card ?card ?oldcard))))

;; move king from talon to column - card is the only card in talon

	(:action tal-to-col-h
		:parameters (?card - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card ?card)
			(bottomtalon ?card ?card)
			(toptalon ?card ?card)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols)
			(talonplayable ?card ?card))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(bottomcol ?card ?card)
			(colspace ?ncols ?ncols)
			(not (colspace ?cols ?cols))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (bottomtalon ?card ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from talon to home

	(:action tal-to-home
		:parameters (?card ?cardabove ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card ?card)
			(ontalon ?cardabove ?cardabove ?card)
			(ontalon ?card ?card ?cardbelow)
			(suit ?card ?card ?cardsuit)
			(suit ?homecard ?homecard ?cardsuit)
			(home ?homecard ?homecard)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard))
		:effect (and
			(talonplayable ?cardbelow ?cardbelow)
			(not (talonplayable ?card ?card))
			(ontalon ?cardabove ?cardabove ?cardbelow)
			(not (ontalon ?cardabove ?cardabove ?card))
			(not (ontalon ?card ?card ?cardbelow))
			(home ?card ?card)
			(not (home ?homecard ?homecard))))

;; move card from talon to home - card is bottom card in talon

	(:action tal-to-home-b
		:parameters (?card ?cardabove ?homecard  - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card ?card)
			(ontalon ?cardabove ?cardabove ?card)
			(bottomtalon ?card ?card)
			(home ?homecard ?homecard)
			(suit ?card ?card ?cardsuit)
			(suit ?homecard ?homecard ?cardsuit)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard))
		:effect (and
			(bottomtalon ?cardabove ?cardabove)
			(talonplayable ?cardabove ?cardabove)
			(home ?card ?card)
			(not (bottomtalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (ontalon ?cardabove ?cardabove ?card))
			(not (home ?homecard ?homecard))))

;; move card from talon to home - card is top card in talon

	(:action tal-to-home-c
		:parameters (?card ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(ontalon ?card ?card ?cardbelow)
			(talonplayable ?card ?card)
			(toptalon ?card ?card)
			(home ?homecard ?homecard)
			(suit ?card ?card ?cardsuit)
			(suit ?homecard ?homecard ?cardsuit)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard))
		:effect (and
			(toptalon ?cardbelow ?cardbelow)
			(talonplayable ?cardbelow ?cardbelow)
			(home ?card ?card)
			(not (home ?homecard ?homecard))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (ontalon ?card ?card ?cardbelow))))

;; move card from talon to home - card is the only card in talon

	(:action tal-to-home-d
		:parameters (?card ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(bottomtalon ?card ?card)
			(toptalon ?card ?card)
			(talonplayable ?card ?card)
			(home ?homecard ?homecard)
			(suit ?card ?card ?cardsuit)
			(suit ?homecard ?homecard ?cardsuit)
			(value ?card ?card ?vcard)
			(value ?homecard ?homecard ?vhomecard)
			(successor ?vcard ?vcard ?vhomecard))
		:effect (and
			(home ?card ?card)
			(not (home ?homecard ?homecard))
			(not (toptalon ?card ?card))
			(not (talonplayable ?card ?card))
			(not (bottomtalon ?card ?card))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from home to column (pointless to move aces from home)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from home to column
	
	(:action home-to-col
		:parameters (?card ?cardbelow ?newcard - card ?cardsuit - suittype
			?vcard ?vcardbelow - num)
		:precondition (and
			(home ?card ?card)
			(suit ?card ?card ?cardsuit)
			(suit ?cardbelow ?cardbelow ?cardsuit)
			(value ?card ?card ?vcard)
			(value ?cardbelow ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcard ?vcardbelow)
			(canstack ?card ?card ?newcard)
			(clear ?newcard ?newcard))
		:effect (and
			(clear ?card ?card)
			(faceup ?card ?card)
			(home ?cardbelow ?cardbelow)
			(on ?card ?card ?newcard)
			(not (home ?card ?card))
			(not (clear ?newcard ?newcard))))

;; move king from home to column
	
	(:action home-to-col-a
		:parameters (?card ?cardbelow - card ?cardsuit - suittype
			?vcard ?vcardbelow - num ?cols ?ncols - colnum)
		:precondition (and
			(home ?card ?card)
			(king ?card ?card)
			(suit ?card ?card ?cardsuit)
			(suit ?cardbelow ?cardbelow ?cardsuit)
			(value ?card ?card ?vcard)
			(value ?cardbelow ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcard ?vcardbelow)
			(colspace ?cols ?cols)
			(colsuccessor ?cols ?cols ?ncols))
		:effect (and
			(home ?cardbelow ?cardbelow)
			(bottomcol ?card ?card)
			(clear ?card ?card)
			(faceup ?card ?card)
			(colspace ?ncols ?ncols)
			(not (colspace ?cols ?cols))
			(not (home ?card ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Turn Deck
;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			
;; turn deck

	(:action turn-deck
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card ?card)
			(ontalon ?c1 ?c1 ?card))
		:effect (and
			(talonplayable ?c1 ?c1)
			(not (talonplayable ?card ?card))))

;; turn deck - top talon card is currently talon playable	- at least 4 cards in talon

	(:action turn-deck-a
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card ?card)
			(toptalon ?card ?card)
			(bottomtalon ?c1 ?c1))
		:effect (and
			(talonplayable ?c1 ?c1)
			(not (talonplayable ?card ?card)))))
			
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; problem
(define (problem thoughtful-s5-t4)
(:domain thoughtful-typed)
(:objects
    C0 CA C2 C3 C4 C5 
    D0 DA D2 D3 D4 D5 
    H0 HA H2 H3 H4 H5 
    S0 SA S2 S3 S4 S5 
 - card
    COLN0 COLN1 COLN2 COLN3 COLN4
 - colnum
    N0 N1 N2 N3 N4 N5
 - num
    C D H S
 - suittype
)
(:init
(VALUE C0 C0 N0)
(VALUE D0 D0 N0)
(VALUE H0 H0 N0)
(VALUE S0 S0 N0)
(VALUE CA CA N1)
(VALUE DA DA N1)
(VALUE HA HA N1)
(VALUE SA SA N1)
(VALUE C2 C2 N2)
(VALUE D2 D2 N2)
(VALUE H2 H2 N2)
(VALUE S2 S2 N2)
(VALUE C3 C3 N3)
(VALUE D3 D3 N3)
(VALUE H3 H3 N3)
(VALUE S3 S3 N3)
(VALUE C4 C4 N4)
(VALUE D4 D4 N4)
(VALUE H4 H4 N4)
(VALUE S4 S4 N4)
(VALUE C5 C5 N5)
(VALUE D5 D5 N5)
(VALUE H5 H5 N5)
(VALUE S5 S5 N5)
(COLSUCCESSOR COLN1 COLN1 COLN0)
(COLSUCCESSOR COLN2 COLN2 COLN1)
(COLSUCCESSOR COLN3 COLN3 COLN2)
(COLSUCCESSOR COLN4 COLN4 COLN3)
(SUCCESSOR N1 N1 N0)
(SUCCESSOR N2 N2 N1)
(SUCCESSOR N3 N3 N2)
(SUCCESSOR N4 N4 N3)
(SUCCESSOR N5 N5 N4)
(SUIT C0 C0 C)
(SUIT D0 D0 D)
(SUIT H0 H0 H)
(SUIT S0 S0 S)
(SUIT CA CA C)
(SUIT DA DA D)
(SUIT HA HA H)
(SUIT SA SA S)
(SUIT C2 C2 C)
(SUIT D2 D2 D)
(SUIT H2 H2 H)
(SUIT S2 S2 S)
(SUIT C3 C3 C)
(SUIT D3 D3 D)
(SUIT H3 H3 H)
(SUIT S3 S3 S)
(SUIT C4 C4 C)
(SUIT D4 D4 D)
(SUIT H4 H4 H)
(SUIT S4 S4 S)
(SUIT C5 C5 C)
(SUIT D5 D5 D)
(SUIT H5 H5 H)
(SUIT S5 S5 S)
(KING C5 C5)
(KING D5 D5)
(KING H5 H5)
(KING S5 S5)
(CANSTACK C2 C2 D3)
(CANSTACK C2 C2 H3)
(CANSTACK S2 S2 D3)
(CANSTACK S2 S2 H3)
(CANSTACK D2 D2 C3)
(CANSTACK D2 D2 S3)
(CANSTACK H2 H2 C3)
(CANSTACK H2 H2 S3)
(CANSTACK C3 C3 D4)
(CANSTACK C3 C3 H4)
(CANSTACK S3 S3 D4)
(CANSTACK S3 S3 H4)
(CANSTACK D3 D3 C4)
(CANSTACK D3 D3 S4)
(CANSTACK H3 H3 C4)
(CANSTACK H3 H3 S4)
(CANSTACK C4 C4 D5)
(CANSTACK C4 C4 H5)
(CANSTACK S4 S4 D5)
(CANSTACK S4 S4 H5)
(CANSTACK D4 D4 C5)
(CANSTACK D4 D4 S5)
(CANSTACK H4 H4 C5)
(CANSTACK H4 H4 S5)
(COLSPACE COLN0 COLN0)
(BOTTOMCOL H5 H5)
(CLEAR H5 H5)
(FACEUP H5 H5)
(BOTTOMCOL CA CA)
(ON H2 H2 CA)
(CLEAR H2 H2)
(FACEUP H2 H2)
(BOTTOMCOL D2 D2)
(ON S5 S5 D2)
(ON C3 C3 S5)
(CLEAR C3 C3)
(FACEUP C3 C3)
(BOTTOMCOL H3 H3)
(ON C2 C2 H3)
(ON S4 S4 C2)
(ON D4 D4 S4)
(CLEAR D4 D4)
(FACEUP D4 D4)
(BOTTOMTALON C5 C5)
(ONTALON D3 D3 C5)
(ONTALON H4 H4 D3)
(ONTALON C4 C4 H4)
(ONTALON S3 S3 C4)
(ONTALON D5 D5 S3)
(ONTALON SA SA D5)
(ONTALON HA HA SA)
(ONTALON DA DA HA)
(ONTALON S2 S2 DA)
(TOPTALON S2 S2)
(TALONPLAYABLE H4 H4)
(HOME C0 C0)
(HOME D0 D0)
(HOME H0 H0)
(HOME S0 S0)
)
(:goal
(and
(HOME C5 C5)
(HOME D5 D5)
(HOME H5 H5)
(HOME S5 S5)
)
)
)

; plan
1. (turn-deck h4 c4)
   deleted: (talonplayable h4 h4)
   added: (talonplayable c4 c4)
   goals met: 0 of 4
2. (move-col-to-col c3 s5 d4)
   deleted: (on c3 c3 s5) (clear d4 d4)
   added: (on c3 c3 d4) (clear s5 s5) (faceup s5 s5)
   goals met: 0 of 4
3. (turn-deck c4 s3)
   deleted: (talonplayable c4 c4)
   added: (talonplayable s3 s3)
   goals met: 0 of 4
4. (move-col-to-col h2 ca c3)
   deleted: (on h2 h2 ca) (clear c3 c3)
   added: (on h2 h2 c3) (clear ca ca) (faceup ca ca)
   goals met: 0 of 4
5. (col-to-home-b ca c0 c n1 n0 coln0 coln1)
   deleted: (home c0 c0) (faceup ca ca) (clear ca ca) (bottomcol ca ca) (colspace coln0 coln0)
   added: (home ca ca) (colspace coln1 coln1)
   goals met: 0 of 4
6. (move-col-to-col-c s5 d2 coln1 coln0)
   deleted: (on s5 s5 d2) (colspace coln1 coln1)
   added: (bottomcol s5 s5) (clear d2 d2) (faceup d2 d2) (colspace coln0 coln0)
   goals met: 0 of 4
7. (turn-deck s3 d5)
   deleted: (talonplayable s3 s3)
   added: (talonplayable d5 d5)
   goals met: 0 of 4
8. (turn-deck d5 sa)
   deleted: (talonplayable d5 d5)
   added: (talonplayable sa sa)
   goals met: 0 of 4
9. (tal-to-home sa ha d5 s0 s n1 n0)
   deleted: (talonplayable sa sa) (ontalon ha ha sa) (ontalon sa sa d5) (home s0 s0)
   added: (talonplayable d5 d5) (ontalon ha ha d5) (home sa sa)
   goals met: 0 of 4
10. (turn-deck d5 ha)
   deleted: (talonplayable d5 d5)
   added: (talonplayable ha ha)
   goals met: 0 of 4
11. (tal-to-home ha da d5 h0 h n1 n0)
   deleted: (talonplayable ha ha) (ontalon da da ha) (ontalon ha ha d5) (home h0 h0)
   added: (talonplayable d5 d5) (ontalon da da d5) (home ha ha)
   goals met: 0 of 4
12. (turn-deck d5 da)
   deleted: (talonplayable d5 d5)
   added: (talonplayable da da)
   goals met: 0 of 4
13. (col-to-home h2 c3 h n2 ha n1)
   deleted: (on h2 h2 c3) (home ha ha) (faceup h2 h2) (clear h2 h2)
   added: (home h2 h2) (clear c3 c3) (on h2 h2 ha)
   goals met: 0 of 4
14. (turn-deck da s2)
   deleted: (talonplayable da da)
   added: (talonplayable s2 s2)
   goals met: 0 of 4
15. (tal-to-home-c s2 da sa s n2 n1)
   deleted: (home sa sa) (toptalon s2 s2) (talonplayable s2 s2) (ontalon s2 s2 da)
   added: (toptalon da da) (talonplayable da da) (home s2 s2)
   goals met: 0 of 4
16. (tal-to-home-c da d5 d0 d n1 n0)
   deleted: (home d0 d0) (toptalon da da) (talonplayable da da) (ontalon da da d5)
   added: (toptalon d5 d5) (talonplayable d5 d5) (home da da)
   goals met: 0 of 4
17. (col-to-home-b d2 da d n2 n1 coln0 coln1)
   deleted: (home da da) (faceup d2 d2) (clear d2 d2) (bottomcol d2 d2) (colspace coln0 coln0)
   added: (home d2 d2) (colspace coln1 coln1)
   goals met: 0 of 4
18. (tal-to-col-g d5 s3 coln1 coln0)
   deleted: (colspace coln1 coln1) (toptalon d5 d5) (talonplayable d5 d5) (ontalon d5 d5 s3)
   added: (clear d5 d5) (faceup d5 d5) (toptalon s3 s3) (talonplayable s3 s3) (bottomcol d5 d5) (colspace coln0 coln0)
   goals met: 0 of 4
19. (tal-to-home-c s3 c4 s2 s n3 n2)
   deleted: (home s2 s2) (toptalon s3 s3) (talonplayable s3 s3) (ontalon s3 s3 c4)
   added: (toptalon c4 c4) (talonplayable c4 c4) (home s3 s3)
   goals met: 0 of 4
20. (move-col-to-col d4 s4 s5)
   deleted: (on d4 d4 s4) (clear s5 s5)
   added: (on d4 d4 s5) (clear s4 s4) (faceup s4 s4)
   goals met: 0 of 4
21. (col-to-home s4 c2 s n4 s3 n3)
   deleted: (on s4 s4 c2) (home s3 s3) (faceup s4 s4) (clear s4 s4)
   added: (home s4 s4) (clear c2 c2) (faceup c2 c2) (on s4 s4 s3)
   goals met: 0 of 4
22. (col-to-home c2 h3 c n2 ca n1)
   deleted: (on c2 c2 h3) (home ca ca) (faceup c2 c2) (clear c2 c2)
   added: (home c2 c2) (clear h3 h3) (faceup h3 h3) (on c2 c2 ca)
   goals met: 0 of 4
23. (col-to-home-b h3 h2 h n3 n2 coln0 coln1)
   deleted: (home h2 h2) (faceup h3 h3) (clear h3 h3) (bottomcol h3 h3) (colspace coln0 coln0)
   added: (home h3 h3) (colspace coln1 coln1)
   goals met: 0 of 4
24. (col-to-home c3 d4 c n3 c2 n2)
   deleted: (on c3 c3 d4) (home c2 c2) (faceup c3 c3) (clear c3 c3)
   added: (home c3 c3) (clear d4 d4) (on c3 c3 c2)
   goals met: 0 of 4
25. (tal-to-home-c c4 h4 c3 c n4 n3)
   deleted: (home c3 c3) (toptalon c4 c4) (talonplayable c4 c4) (ontalon c4 c4 h4)
   added: (toptalon h4 h4) (talonplayable h4 h4) (home c4 c4)
   goals met: 0 of 4
26. (tal-to-home-c h4 d3 h3 h n4 n3)
   deleted: (home h3 h3) (toptalon h4 h4) (talonplayable h4 h4) (ontalon h4 h4 d3)
   added: (toptalon d3 d3) (talonplayable d3 d3) (home h4 h4)
   goals met: 0 of 4
27. (col-to-home-b h5 h4 h n5 n4 coln1 coln2)
   deleted: (home h4 h4) (faceup h5 h5) (clear h5 h5) (bottomcol h5 h5) (colspace coln1 coln1)
   added: (home h5 h5) (colspace coln2 coln2)
   goals met: 1 of 4
28. (tal-to-home-c d3 c5 d2 d n3 n2)
   deleted: (home d2 d2) (toptalon d3 d3) (talonplayable d3 d3) (ontalon d3 d3 c5)
   added: (toptalon c5 c5) (talonplayable c5 c5) (home d3 d3)
   goals met: 1 of 4
29. (tal-to-home-d c5 c4 c n5 n4)
   deleted: (home c4 c4) (toptalon c5 c5) (talonplayable c5 c5) (bottomtalon c5 c5)
   added: (home c5 c5)
   goals met: 2 of 4
30. (col-to-home d4 s5 d n4 d3 n3)
   deleted: (on d4 d4 s5) (home d3 d3) (faceup d4 d4) (clear d4 d4)
   added: (home d4 d4) (clear s5 s5) (on d4 d4 d3)
   goals met: 2 of 4
31. (col-to-home-b d5 d4 d n5 n4 coln2 coln3)
   deleted: (home d4 d4) (faceup d5 d5) (clear d5 d5) (bottomcol d5 d5) (colspace coln2 coln2)
   added: (home d5 d5) (colspace coln3 coln3)
   goals met: 3 of 4
32. (col-to-home-b s5 s4 s n5 n4 coln3 coln4)
   deleted: (home s4 s4) (faceup s5 s5) (clear s5 s5) (bottomcol s5 s5) (colspace coln3 coln3)
   added: (home s5 s5) (colspace coln4 coln4)
   goals met: 4 of 4
